05-performance-testing/jmeter/BasicTestPlan.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.6.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Basic Test Plan" enabled="true">
      <stringProp name="TestPlan.comments">Demonstrates: CSV parameterization, a closed-model Thread Group, and percentile reporting via Aggregate Report.</stringProp>
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>

      <!-- CSV Data Set Config: reads data/users.csv, one row per thread iteration -->
      <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set Config" enabled="true">
        <stringProp name="filename">data/users.csv</stringProp>
        <stringProp name="fileEncoding">UTF-8</stringProp>
        <stringProp name="variableNames">id,name,role</stringProp>
        <boolProp name="ignoreFirstLine">true</boolProp>
        <stringProp name="delimiter">,</stringProp>
        <boolProp name="quotedData">false</boolProp>
        <boolProp name="recycle">true</boolProp>
        <boolProp name="stopThread">false</boolProp>
        <stringProp name="shareMode">shareMode.all</stringProp>
      </CSVDataSet>
      <hashTree/>

      <!--
        CLOSED WORKLOAD MODEL:
        A standard Thread Group is inherently closed, each of the 20 threads
        (virtual users) loops and waits for a response before its next request.
      -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group (closed model)" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">10</stringProp>
        </elementProp>
        <!--
          Little's Law sizing note:
          Target throughput ~50 req/s, expected response time ~0.5s
          L = λ × W = 50 × 0.5 = 25 concurrent users needed to sustain that
          rate. This test plan uses 20 threads as a smaller example — bump
          ThreadGroup.num_threads to 25+ to actually hit 50 req/s here.
        -->
        <stringProp name="ThreadGroup.num_threads">20</stringProp>
        <stringProp name="ThreadGroup.ramp_time">10</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
      </ThreadGroup>
      <hashTree>

        <!-- HTTP Request sampler, parameterized with CSV data -->
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="GET user" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">false</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments"/>
          </elementProp>
          <stringProp name="HTTPSampler.domain">jsonplaceholder.typicode.com</stringProp>
          <stringProp name="HTTPSampler.protocol">https</stringProp>
          <stringProp name="HTTPSampler.path">/users/${id}</stringProp>
          <stringProp name="HTTPSampler.method">GET</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree>

          <!--
            Response Assertion (body): JMeter auto-fails non-2xx responses, but a
            200 carrying the wrong user would otherwise pass.
            This asserts the id round-trip: the body must contain the same ${id}
            the CSV supplied to the request. We assert on id rather than name
            because users.csv holds placeholder names (alice, bob) while the API
            returns its own (Leanne Graham).
          -->
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert body returns requested user id" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="id_roundtrip">&quot;id&quot;:\s*${id}\b</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Response body did not contain the requested user id ${id}</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>

          <!--
            Second assertion: the payload is actually shaped like a user record,
            not just any JSON that happens to mention the id.
          -->
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Assert body is shaped like a user" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="has_name">&quot;name&quot;:\s*&quot;.+&quot;</stringProp>
              <stringProp name="has_email">&quot;email&quot;:\s*&quot;.+@.+&quot;</stringProp>
            </collectionProp>
            <stringProp name="Assertion.custom_message">Response body was not a well-formed user record (missing name/email)</stringProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">2</intProp>
          </ResponseAssertion>
          <hashTree/>

          <!-- Constant Timer: think time between requests, similar to k6's sleep() -->
          <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Think Time" enabled="true">
            <stringProp name="ConstantTimer.delay">1000</stringProp>
          </ConstantTimer>
          <hashTree/>

        </hashTree>

        <!--
          Aggregate Report: JMeter's built-in listener that shows percentiles
          (50/90/95/99) per sampler, not just the average.
        -->
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">results/aggregate-results.csv</stringProp>
        </ResultCollector>
        <hashTree/>

        <!-- Summary Report: quick pass/fail + throughput overview -->
        <ResultCollector guiclass="SummaryReport" testclass="ResultCollector" testname="Summary Report" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">results/summary-results.csv</stringProp>
        </ResultCollector>
        <hashTree/>

      </hashTree>
    </hashTree>
  </hashTree>
</jmeterTestPlan>